apache/nuttx/arch/arm/src/common/stm32/stm32_tim_m3m4_v1v2v3.c
#undef HAVE_TIM_GPIOCONFIG
#if defined(CONFIG_STM32_TIM1)
#  if defined(GPIO_TIM1_CH1OUT) ||defined(GPIO_TIM1_CH2OUT)||\
      defined(GPIO_TIM1_CH3OUT) ||defined(GPIO_TIM1_CH4OUT)
#    undef  HAVE_TIM_GPIOCONFIG
#    define HAVE_TIM_GPIOCONFIG  1
#    define HAVE_TIM1_GPIOCONFIG 1
#endif
#endif

#if defined(CONFIG_STM32_TIM2)
#  if defined(GPIO_TIM2_CH1OUT) ||defined(GPIO_TIM2_CH2OUT)||\
      defined(GPIO_TIM2_CH3OUT) ||defined(GPIO_TIM2_CH4OUT)
#    undef  HAVE_TIM_GPIOCONFIG
#    define HAVE_TIM_GPIOCONFIG  1
#    define HAVE_TIM2_GPIOCONFIG 1
#endif
#endif

#if defined(CONFIG_STM32_TIM3)
#  if defined(GPIO_TIM3_CH1OUT) ||defined(GPIO_TIM3_CH2OUT)||\
      defined(GPIO_TIM3_CH3OUT) ||defined(GPIO_TIM3_CH4OUT)
#    undef  HAVE_TIM_GPIOCONFIG
#    define HAVE_TIM_GPIOCONFIG  1
#    define HAVE_TIM3_GPIOCONFIG 1
#endif
#endif

#if defined(CONFIG_STM32_TIM4)
#  if defined(GPIO_TIM4_CH1OUT) ||defined(GPIO_TIM4_CH2OUT)||\
      defined(GPIO_TIM4_CH3OUT) ||defined(GPIO_TIM4_CH4OUT)
#    undef  HAVE_TIM_GPIOCONFIG
#    define HAVE_TIM_GPIOCONFIG  1
#    define HAVE_TIM4_GPIOCONFIG 1
#endif
#endif

#if defined(CONFIG_STM32_TIM5)
#  if defined(GPIO_TIM5_CH1OUT) ||defined(GPIO_TIM5_CH2OUT)||\
      defined(GPIO_TIM5_CH3OUT) ||defined(GPIO_TIM5_CH4OUT)
#    undef  HAVE_TIM_GPIOCONFIG
#    define HAVE_TIM_GPIOCONFIG  1
#    define HAVE_TIM5_GPIOCONFIG 1
#endif
#endif

#if defined(CONFIG_STM32_TIM8)
#  if defined(GPIO_TIM8_CH1OUT) ||defined(GPIO_TIM8_CH2OUT)||\
      defined(GPIO_TIM8_CH3OUT) ||defined(GPIO_TIM8_CH4OUT)
#    undef  HAVE_TIM_GPIOCONFIG
#    define HAVE_TIM_GPIOCONFIG  1
#    define HAVE_TIM8_GPIOCONFIG 1
#endif
#endif

#if defined(CONFIG_STM32_TIM9)
#  if defined(GPIO_TIM9_CH1OUT) ||defined(GPIO_TIM9_CH2OUT)||\
      defined(GPIO_TIM9_CH3OUT) ||defined(GPIO_TIM9_CH4OUT)
#    define HAVE_TIM9_GPIOCONFIG 1
#endif
#endif

#if defined(CONFIG_STM32_TIM10)
#  if defined(GPIO_TIM10_CH1OUT) ||defined(GPIO_TIM10_CH2OUT)||\
      defined(GPIO_TIM10_CH3OUT) ||defined(GPIO_TIM10_CH4OUT)
#    define HAVE_TIM10_GPIOCONFIG 1
#endif
#endif

#if defined(CONFIG_STM32_TIM11)
#  if defined(GPIO_TIM11_CH1OUT) ||defined(GPIO_TIM11_CH2OUT)||\
      defined(GPIO_TIM11_CH3OUT) ||defined(GPIO_TIM11_CH4OUT)
#    define HAVE_TIM11_GPIOCONFIG 1
#endif
#endif

#if defined(CONFIG_STM32_TIM12)
#  if defined(GPIO_TIM12_CH1OUT) ||defined(GPIO_TIM12_CH2OUT)||\
      defined(GPIO_TIM12_CH3OUT) ||defined(GPIO_TIM12_CH4OUT)
#    define HAVE_TIM12_GPIOCONFIG 1
#endif
#endif

#if defined(CONFIG_STM32_TIM13)
#  if defined(GPIO_TIM13_CH1OUT) ||defined(GPIO_TIM13_CH2OUT)||\
      defined(GPIO_TIM13_CH3OUT) ||defined(GPIO_TIM13_CH4OUT)
#    define HAVE_TIM13_GPIOCONFIG 1
#endif
#endif

#if defined(CONFIG_STM32_TIM14)
#  if defined(GPIO_TIM14_CH1OUT) ||defined(GPIO_TIM14_CH2OUT)||\
      defined(GPIO_TIM14_CH3OUT) ||defined(GPIO_TIM14_CH4OUT)
#    define HAVE_TIM14_GPIOCONFIG 1
#endif
#endif

#if defined(CONFIG_STM32_TIM15)
#  if defined(GPIO_TIM15_CH1OUT) ||defined(GPIO_TIM15_CH2OUT)||\
      defined(GPIO_TIM15_CH3OUT) ||defined(GPIO_TIM15_CH4OUT)
#    define HAVE_TIM15_GPIOCONFIG 1
#endif
#endif

#if defined(CONFIG_STM32_TIM16)
#  if defined(GPIO_TIM16_CH1OUT) ||defined(GPIO_TIM16_CH2OUT)||\
      defined(GPIO_TIM16_CH3OUT) ||defined(GPIO_TIM16_CH4OUT)
#    define HAVE_TIM16_GPIOCONFIG 1
#endif
#endif

#if defined(CONFIG_STM32_TIM17)
#  if defined(GPIO_TIM17_CH1OUT) ||defined(GPIO_TIM17_CH2OUT)||\
      defined(GPIO_TIM17_CH3OUT) ||defined(GPIO_TIM17_CH4OUT)
#    define HAVE_TIM17_GPIOCONFIG 1
#endif
#endif

/* This module then only compiles if there are enabled timers that are not
 * intended for some other purpose.
 */

#if defined(CONFIG_STM32_TIM1)  || defined(CONFIG_STM32_TIM2)  || \
    defined(CONFIG_STM32_TIM3)  || defined(CONFIG_STM32_TIM4)  || \
    defined(CONFIG_STM32_TIM5)  || defined(CONFIG_STM32_TIM6)  || \
    defined(CONFIG_STM32_TIM7)  || defined(CONFIG_STM32_TIM8)  || \
    defined(CONFIG_STM32_TIM9)  || defined(CONFIG_STM32_TIM10) || \
    defined(CONFIG_STM32_TIM11) || defined(CONFIG_STM32_TIM12) || \
    defined(CONFIG_STM32_TIM13) || defined(CONFIG_STM32_TIM14) || \
    defined(CONFIG_STM32_TIM15) || defined(CONFIG_STM32_TIM16) || \
    defined(CONFIG_STM32_TIM17)

/****************************************************************************
 * Private Types
 ****************************************************************************/

/* TIM Device Structure */

struct stm32_tim_priv_s
{
  const struct stm32_tim_ops_s *ops;
  stm32_tim_mode_t mode;
  uint32_t base;                      /* TIMn base address */
};

/****************************************************************************
 * Private Function prototypes
 ****************************************************************************/

/* Register helpers */

static inline uint16_t stm32_getreg16(struct stm32_tim_dev_s *dev,
                                      uint8_t offset);
static inline void stm32_putreg16(struct stm32_tim_dev_s *dev,
                                  uint8_t offset, uint16_t value);
static inline void stm32_modifyreg16(struct stm32_tim_dev_s *dev,
                                     uint8_t offset, uint16_t clearbits,
                                     uint16_t setbits);
static inline uint32_t stm32_getreg32(struct stm32_tim_dev_s *dev,
                                      uint8_t offset);
static inline void stm32_putreg32(struct stm32_tim_dev_s *dev,
                                  uint8_t offset, uint32_t value);

/* Timer helpers */

static void stm32_tim_reload_counter(struct stm32_tim_dev_s *dev);
static void stm32_tim_enable(struct stm32_tim_dev_s *dev);
static void stm32_tim_disable(struct stm32_tim_dev_s *dev);
static void stm32_tim_reset(struct stm32_tim_dev_s *dev);

#ifdef HAVE_TIM_GPIOCONFIG
static void stm32_tim_gpioconfig(uint32_t cfg, stm32_tim_channel_t mode);
#endif

/* Timer methods */

static int  stm32_tim_setmode(struct stm32_tim_dev_s *dev,
                              stm32_tim_mode_t mode);
static int  stm32_tim_setclock(struct stm32_tim_dev_s *dev,
                               uint32_t freq);
static void stm32_tim_setperiod(struct stm32_tim_dev_s *dev,
                                uint32_t period);
static uint32_t stm32_tim_getcounter(struct stm32_tim_dev_s *dev);
static void stm32_tim_setcounter(struct stm32_tim_dev_s *dev,
                                 uint32_t count);
static int  stm32_tim_getwidth(struct stm32_tim_dev_s *dev);
static int  stm32_tim_setchannel(struct stm32_tim_dev_s *dev,
                                 uint8_t channel, stm32_tim_channel_t mode);
static int  stm32_tim_setcompare(struct stm32_tim_dev_s *dev,
                                 uint8_t channel, uint32_t compare);
static int  stm32_tim_getcapture(struct stm32_tim_dev_s *dev,
                                 uint8_t channel);
static int  stm32_tim_setisr(struct stm32_tim_dev_s *dev,
                             xcpt_t handler, void *arg, int source);
static void stm32_tim_enableint(struct stm32_tim_dev_s *dev,
                                int source);
static void stm32_tim_disableint(struct stm32_tim_dev_s *dev,
                                 int source);
static void stm32_tim_ackint(struct stm32_tim_dev_s *dev, int source);
static int  stm32_tim_checkint(struct stm32_tim_dev_s *dev, int source);

/****************************************************************************
 * Private Data
 ****************************************************************************/

static const struct stm32_tim_ops_s stm32_tim_ops =
{
  .enable     = stm32_tim_enable,
  .disable    = stm32_tim_disable,
  .setmode    = stm32_tim_setmode,
  .setclock   = stm32_tim_setclock,
  .setperiod  = stm32_tim_setperiod,
  .getcounter = stm32_tim_getcounter,
  .setcounter = stm32_tim_setcounter,
  .getwidth   = stm32_tim_getwidth,
  .setchannel = stm32_tim_setchannel,
  .setcompare = stm32_tim_setcompare,
  .getcapture = stm32_tim_getcapture,
  .setisr     = stm32_tim_setisr,
  .enableint  = stm32_tim_enableint,
  .disableint = stm32_tim_disableint,
  .ackint     = stm32_tim_ackint,
  .checkint   = stm32_tim_checkint,
};

