apache/nuttx/arch/arm/src/common/stm32/stm32_tim_m3m4_v1v2v3.c
  /* Select a pre-scaler value for this timer using the input clock
   * frequency.
   */

  prescaler = freqin / freq;

  /* We need to decrement value for '1', but only, if that will not to
   * cause underflow.
   */

  if (prescaler > 0)
    {
      prescaler--;
    }

  /* Check for overflow as well. */

  if (prescaler > 0xffff)
    {
      prescaler = 0xffff;
    }

  stm32_putreg16(dev, STM32_GTIM_PSC_OFFSET, prescaler);
  stm32_tim_enable(dev);

  return prescaler;
}

/****************************************************************************
 * Name: stm32_tim_setperiod
 ****************************************************************************/

static void stm32_tim_setperiod(struct stm32_tim_dev_s *dev,
                                uint32_t period)
{
  DEBUGASSERT(dev != NULL);
  stm32_putreg32(dev, STM32_GTIM_ARR_OFFSET, period);
}

/****************************************************************************
 * Name: stm32_tim_getcounter
 ****************************************************************************/

static uint32_t stm32_tim_getcounter(struct stm32_tim_dev_s *dev)
{
  DEBUGASSERT(dev != NULL);
  return stm32_tim_getwidth(dev) > 16 ?
    stm32_getreg32(dev, STM32_GTIM_CNT_OFFSET) :
    (uint32_t)stm32_getreg16(dev, STM32_GTIM_CNT_OFFSET);
}

/****************************************************************************
 * Name: stm32_tim_setcounter
 ****************************************************************************/

static void stm32_tim_setcounter(struct stm32_tim_dev_s *dev,
                                 uint32_t count)
{
  DEBUGASSERT(dev != NULL);

  if (stm32_tim_getwidth(dev) > 16)
    {
      stm32_putreg32(dev, STM32_GTIM_CNT_OFFSET, count);
    }
  else
    {
      stm32_putreg16(dev, STM32_GTIM_CNT_OFFSET, (uint16_t)count);
    }
}

/****************************************************************************
 * Name: stm32_tim_getwidth
 ****************************************************************************/

static int stm32_tim_getwidth(struct stm32_tim_dev_s *dev)
{
  /* Only TIM2 and TIM5 timers may be 32-bits in width
   *
   * Reference Table 2 of en.DM00042534.pdf
   */

  switch (((struct stm32_tim_priv_s *)dev)->base)
    {
      /* TIM2 is 32-bits on all except F10x, L0x, and L1x lines */

#if defined(CONFIG_STM32_TIM2) && !defined(STM32_STM32F10XX) && \
   !defined(STM32_STM32L15XX)
      case STM32_TIM2_BASE:
        return 32;
#endif

      /* TIM5 is 32-bits on all except F10x lines */

#if defined(CONFIG_STM32_TIM5) && !defined(STM32_STM32F10XX)
      case STM32_TIM5_BASE:
        return 32;
#endif

      /* All others are 16-bit times */

      default:
        return 16;
    }
}

/****************************************************************************
 * Name: stm32_tim_setchannel
 ****************************************************************************/

static int stm32_tim_setchannel(struct stm32_tim_dev_s *dev,
                                uint8_t channel, stm32_tim_channel_t mode)
{
  uint16_t ccmr_orig   = 0;
  uint16_t ccmr_val    = 0;
  uint16_t ccmr_mask   = 0xff;
  uint16_t ccer_val    = stm32_getreg16(dev, STM32_GTIM_CCER_OFFSET);
  uint8_t  ccmr_offset = STM32_GTIM_CCMR1_OFFSET;

  DEBUGASSERT(dev != NULL);

  /* Further we use range as 0..3; if channel=0 it will also overflow here */

  if (--channel > 4)
    {
      return -EINVAL;
    }

  /* Assume that channel is disabled and polarity is active high */

  ccer_val &= ~((GTIM_CCER_CC1P | GTIM_CCER_CC1E) <<
                GTIM_CCER_CCXBASE(channel));

  /* This function is not supported on basic timers. To enable or
   * disable it, simply set its clock to valid frequency or zero.
   */

#if STM32_NBTIM > 0
  if (((struct stm32_tim_priv_s *)dev)->base == STM32_TIM6_BASE
#endif
#if STM32_NBTIM > 1
      || ((struct stm32_tim_priv_s *)dev)->base == STM32_TIM7_BASE
#endif
#if STM32_NBTIM > 0
  )
    {
      return -EINVAL;
    }
#endif

  /* Decode configuration */

  switch (mode & STM32_TIM_CH_MODE_MASK)
    {
      case STM32_TIM_CH_DISABLED:
        break;

      case STM32_TIM_CH_OUTPWM:
        ccmr_val = (GTIM_CCMR_MODE_PWM1 << GTIM_CCMR1_OC1M_SHIFT) +
                   GTIM_CCMR1_OC1PE;
        ccer_val |= GTIM_CCER_CC1E << GTIM_CCER_CCXBASE(channel);
        break;

      default:
        return -EINVAL;
    }

  /* Set polarity */

  if (mode & STM32_TIM_CH_POLARITY_NEG)
    {
      ccer_val |= GTIM_CCER_CC1P << GTIM_CCER_CCXBASE(channel);
    }

  /* Define its position (shift) and get register offset */

  if (channel & 1)
    {
      ccmr_val  <<= 8;
      ccmr_mask <<= 8;
    }

  if (channel > 1)
    {
      ccmr_offset = STM32_GTIM_CCMR2_OFFSET;
    }

  ccmr_orig  = stm32_getreg16(dev, ccmr_offset);
  ccmr_orig &= ~ccmr_mask;
  ccmr_orig |= ccmr_val;
  stm32_putreg16(dev, ccmr_offset, ccmr_orig);
  stm32_putreg16(dev, STM32_GTIM_CCER_OFFSET, ccer_val);

  /* set GPIO */

  switch (((struct stm32_tim_priv_s *)dev)->base)
    {
#ifdef CONFIG_STM32_TIM1
      case STM32_TIM1_BASE:
        switch (channel)
          {
#if defined(GPIO_TIM1_CH1OUT)
            case 0:
              stm32_tim_gpioconfig(GPIO_TIM1_CH1OUT, mode); break;
#endif
#if defined(GPIO_TIM1_CH2OUT)
            case 1:
              stm32_tim_gpioconfig(GPIO_TIM1_CH2OUT, mode); break;
#endif
#if defined(GPIO_TIM1_CH3OUT)
            case 2:
              stm32_tim_gpioconfig(GPIO_TIM1_CH3OUT, mode); break;
#endif
#if defined(GPIO_TIM1_CH4OUT)
            case 3:
              stm32_tim_gpioconfig(GPIO_TIM1_CH4OUT, mode); break;
#endif
            default:
              return -EINVAL;
          }
        break;
#endif
#ifdef CONFIG_STM32_TIM2
      case STM32_TIM2_BASE:
        switch (channel)
          {
#if defined(GPIO_TIM2_CH1OUT)
            case 0:
              stm32_tim_gpioconfig(GPIO_TIM2_CH1OUT, mode);
              break;
#endif
#if defined(GPIO_TIM2_CH2OUT)
            case 1:
              stm32_tim_gpioconfig(GPIO_TIM2_CH2OUT, mode);
              break;
#endif
#if defined(GPIO_TIM2_CH3OUT)
            case 2:
              stm32_tim_gpioconfig(GPIO_TIM2_CH3OUT, mode);
              break;
#endif
#if defined(GPIO_TIM2_CH4OUT)
            case 3:
              stm32_tim_gpioconfig(GPIO_TIM2_CH4OUT, mode);
              break;
#endif
            default:
              return -EINVAL;
          }
        break;
#endif
#ifdef CONFIG_STM32_TIM3
      case STM32_TIM3_BASE:
        switch (channel)
          {
#if defined(GPIO_TIM3_CH1OUT)
            case 0:
              stm32_tim_gpioconfig(GPIO_TIM3_CH1OUT, mode);
              break;
#endif
#if defined(GPIO_TIM3_CH2OUT)
            case 1:
              stm32_tim_gpioconfig(GPIO_TIM3_CH2OUT, mode);
              break;
#endif
#if defined(GPIO_TIM3_CH3OUT)
            case 2:
              stm32_tim_gpioconfig(GPIO_TIM3_CH3OUT, mode);
              break;
#endif
#if defined(GPIO_TIM3_CH4OUT)
            case 3:
              stm32_tim_gpioconfig(GPIO_TIM3_CH4OUT, mode);
              break;
#endif
            default:
              return -EINVAL;
          }
        break;
#endif
#ifdef CONFIG_STM32_TIM4
      case STM32_TIM4_BASE:
        switch (channel)
          {
#if defined(GPIO_TIM4_CH1OUT)
            case 0:
              stm32_tim_gpioconfig(GPIO_TIM4_CH1OUT, mode);
              break;
#endif
#if defined(GPIO_TIM4_CH2OUT)
            case 1:
              stm32_tim_gpioconfig(GPIO_TIM4_CH2OUT, mode);
              break;
#endif
#if defined(GPIO_TIM4_CH3OUT)
            case 2:
              stm32_tim_gpioconfig(GPIO_TIM4_CH3OUT, mode);
              break;
#endif
#if defined(GPIO_TIM4_CH4OUT)
            case 3:
              stm32_tim_gpioconfig(GPIO_TIM4_CH4OUT, mode);
              break;
#endif
            default:
              return -EINVAL;
          }
        break;
#endif
#ifdef CONFIG_STM32_TIM5
      case STM32_TIM5_BASE:
        switch (channel)
          {
#if defined(GPIO_TIM5_CH1OUT)
            case 0:
              stm32_tim_gpioconfig(GPIO_TIM5_CH1OUT, mode);
              break;
#endif
#if defined(GPIO_TIM5_CH2OUT)
            case 1:
              stm32_tim_gpioconfig(GPIO_TIM5_CH2OUT, mode);
              break;
#endif
#if defined(GPIO_TIM5_CH3OUT)
            case 2:
              stm32_tim_gpioconfig(GPIO_TIM5_CH3OUT, mode);
              break;
#endif
#if defined(GPIO_TIM5_CH4OUT)
            case 3:
              stm32_tim_gpioconfig(GPIO_TIM5_CH4OUT, mode);
              break;
#endif
            default:
              return -EINVAL;
          }
        break;
#endif
#ifdef CONFIG_STM32_TIM8
      case STM32_TIM8_BASE:
        switch (channel)
          {
#if defined(GPIO_TIM8_CH1OUT)
            case 0:
              stm32_tim_gpioconfig(GPIO_TIM8_CH1OUT, mode); break;
#endif
#if defined(GPIO_TIM8_CH2OUT)
            case 1:
              stm32_tim_gpioconfig(GPIO_TIM8_CH2OUT, mode); break;
#endif
#if defined(GPIO_TIM8_CH3OUT)
            case 2:
              stm32_tim_gpioconfig(GPIO_TIM8_CH3OUT, mode); break;
#endif
#if defined(GPIO_TIM8_CH4OUT)
            case 3:
              stm32_tim_gpioconfig(GPIO_TIM8_CH4OUT, mode); break;
#endif
            default:
              return -EINVAL;
          }
        break;
#endif
#ifdef CONFIG_STM32_TIM9
      case STM32_TIM9_BASE:
        switch (channel)
          {
#if defined(GPIO_TIM9_CH1OUT)
            case 0:
              stm32_tim_gpioconfig(GPIO_TIM9_CH1OUT, mode);
              break;
#endif
#if defined(GPIO_TIM9_CH2OUT)
            case 1:
              stm32_tim_gpioconfig(GPIO_TIM9_CH2OUT, mode);
              break;
#endif
#if defined(GPIO_TIM9_CH3OUT)
            case 2:
              stm32_tim_gpioconfig(GPIO_TIM9_CH3OUT, mode);
              break;
#endif
#if defined(GPIO_TIM9_CH4OUT)
            case 3:
              stm32_tim_gpioconfig(GPIO_TIM9_CH4OUT, mode);
              break;
#endif
            default:
              return -EINVAL;
          }
        break;
#endif
#ifdef CONFIG_STM32_TIM10
      case STM32_TIM10_BASE:
        switch (channel)
          {
#if defined(GPIO_TIM10_CH1OUT)
            case 0:
              stm32_tim_gpioconfig(GPIO_TIM10_CH1OUT, mode);
              break;
#endif
#if defined(GPIO_TIM10_CH2OUT)
            case 1:
              stm32_tim_gpioconfig(GPIO_TIM10_CH2OUT, mode);
              break;
#endif
#if defined(GPIO_TIM10_CH3OUT)
            case 2:
              stm32_tim_gpioconfig(GPIO_TIM10_CH3OUT, mode);
              break;
#endif
#if defined(GPIO_TIM10_CH4OUT)
            case 3:
              stm32_tim_gpioconfig(GPIO_TIM10_CH4OUT, mode);
              break;
#endif
            default:
              return -EINVAL;
          }
        break;
#endif
#ifdef CONFIG_STM32_TIM11
      case STM32_TIM11_BASE:
        switch (channel)
          {
#if defined(GPIO_TIM11_CH1OUT)
            case 0:
              stm32_tim_gpioconfig(GPIO_TIM11_CH1OUT, mode);
              break;
#endif
#if defined(GPIO_TIM11_CH2OUT)
            case 1:
              stm32_tim_gpioconfig(GPIO_TIM11_CH2OUT, mode);
              break;
#endif
#if defined(GPIO_TIM11_CH3OUT)
            case 2:
              stm32_tim_gpioconfig(GPIO_TIM11_CH3OUT, mode);
              break;
#endif
#if defined(GPIO_TIM11_CH4OUT)
            case 3:
              stm32_tim_gpioconfig(GPIO_TIM11_CH4OUT, mode);
              break;
#endif
            default:
              return -EINVAL;
          }
        break;
#endif
#ifdef CONFIG_STM32_TIM12
      case STM32_TIM12_BASE:
        switch (channel)
          {
#if defined(GPIO_TIM12_CH1OUT)
            case 0:
              stm32_tim_gpioconfig(GPIO_TIM12_CH1OUT, mode);
              break;
#endif
#if defined(GPIO_TIM12_CH2OUT)
            case 1:
              stm32_tim_gpioconfig(GPIO_TIM12_CH2OUT, mode);
              break;
#endif
#if defined(GPIO_TIM12_CH3OUT)
            case 2:
              stm32_tim_gpioconfig(GPIO_TIM12_CH3OUT, mode);
              break;
#endif
#if defined(GPIO_TIM12_CH4OUT)
            case 3:
              stm32_tim_gpioconfig(GPIO_TIM12_CH4OUT, mode);
              break;
#endif
            default:
              return -EINVAL;
          }
        break;
#endif
#ifdef CONFIG_STM32_TIM13
      case STM32_TIM13_BASE:
        switch (channel)
          {
#if defined(GPIO_TIM13_CH1OUT)
            case 0:
              stm32_tim_gpioconfig(GPIO_TIM13_CH1OUT, mode);
              break;
#endif
#if defined(GPIO_TIM13_CH2OUT)
            case 1:
              stm32_tim_gpioconfig(GPIO_TIM13_CH2OUT, mode);
              break;
#endif
#if defined(GPIO_TIM13_CH3OUT)
            case 2:
              stm32_tim_gpioconfig(GPIO_TIM13_CH3OUT, mode);
              break;
#endif
#if defined(GPIO_TIM13_CH4OUT)
            case 3:
              stm32_tim_gpioconfig(GPIO_TIM13_CH4OUT, mode);
              break;
#endif
            default:
              return -EINVAL;
          }
        break;
#endif
#ifdef CONFIG_STM32_TIM14
      case STM32_TIM14_BASE:
        switch (channel)
          {
#if defined(GPIO_TIM14_CH1OUT)
            case 0:
              stm32_tim_gpioconfig(GPIO_TIM14_CH1OUT, mode);
              break;
#endif
#if defined(GPIO_TIM14_CH2OUT)
            case 1:
              stm32_tim_gpioconfig(GPIO_TIM14_CH2OUT, mode);
              break;
#endif
#if defined(GPIO_TIM14_CH3OUT)
            case 2:
              stm32_tim_gpioconfig(GPIO_TIM14_CH3OUT, mode);
              break;
#endif
#if defined(GPIO_TIM14_CH4OUT)
            case 3:
              stm32_tim_gpioconfig(GPIO_TIM14_CH4OUT, mode);
              break;
#endif
            default:
              return -EINVAL;
          }
        break;
#endif
#ifdef CONFIG_STM32_TIM15
      case STM32_TIM15_BASE:
        switch (channel)
          {
#if defined(GPIO_TIM15_CH1OUT)
            case 0:
              stm32_tim_gpioconfig(GPIO_TIM15_CH1OUT, mode);
              break;
#endif
#if defined(GPIO_TIM15_CH2OUT)
            case 1:
              stm32_tim_gpioconfig(GPIO_TIM15_CH2OUT, mode);
              break;
#endif
#if defined(GPIO_TIM15_CH3OUT)
            case 2:
              stm32_tim_gpioconfig(GPIO_TIM15_CH3OUT, mode);
              break;
#endif
#if defined(GPIO_TIM15_CH4OUT)
            case 3:
              stm32_tim_gpioconfig(GPIO_TIM15_CH4OUT, mode);
              break;
#endif
            default:
              return -EINVAL;
          }
        break;
#endif
#ifdef CONFIG_STM32_TIM16
      case STM32_TIM16_BASE:
        switch (channel)
          {
#if defined(GPIO_TIM16_CH1OUT)
            case 0:
              stm32_tim_gpioconfig(GPIO_TIM16_CH1OUT, mode);
              break;
#endif
#if defined(GPIO_TIM16_CH2OUT)
            case 1:
              stm32_tim_gpioconfig(GPIO_TIM16_CH2OUT, mode);
              break;
#endif
#if defined(GPIO_TIM16_CH3OUT)
            case 2:
              stm32_tim_gpioconfig(GPIO_TIM16_CH3OUT, mode);
              break;
#endif
#if defined(GPIO_TIM16_CH4OUT)
            case 3:
              stm32_tim_gpioconfig(GPIO_TIM16_CH4OUT, mode);
              break;
#endif
            default:
              return -EINVAL;
          }
        break;
#endif
#ifdef CONFIG_STM32_TIM17
      case STM32_TIM17_BASE:
        switch (channel)
          {
#if defined(GPIO_TIM17_CH1OUT)
            case 0:
              stm32_tim_gpioconfig(GPIO_TIM17_CH1OUT, mode);
              break;
#endif
#if defined(GPIO_TIM17_CH2OUT)
            case 1:
              stm32_tim_gpioconfig(GPIO_TIM17_CH2OUT, mode);
              break;
#endif
#if defined(GPIO_TIM17_CH3OUT)
            case 2:
              stm32_tim_gpioconfig(GPIO_TIM17_CH3OUT, mode);
              break;
#endif
#if defined(GPIO_TIM17_CH4OUT)
            case 3:
              stm32_tim_gpioconfig(GPIO_TIM17_CH4OUT, mode);
              break;
#endif
            default:
              return -EINVAL;
          }
        break;
#endif
      default:
        return -EINVAL;
    }

  return OK;
}

/****************************************************************************
 * Name: stm32_tim_setcompare
 ****************************************************************************/

static int stm32_tim_setcompare(struct stm32_tim_dev_s *dev,
                                uint8_t channel, uint32_t compare)
{
  DEBUGASSERT(dev != NULL);

